Ryan-Rogers/MMSoftware/MM_2015.X/support/pic24f/h/p24FJ192GA110.h
#define _SPI3CON1_CKE_POSITION                   0x00000008
#define _SPI3CON1_CKE_MASK                       0x00000100
#define _SPI3CON1_CKE_LENGTH                     0x00000001

#define _SPI3CON1_SMP_POSITION                   0x00000009
#define _SPI3CON1_SMP_MASK                       0x00000200
#define _SPI3CON1_SMP_LENGTH                     0x00000001

#define _SPI3CON1_MODE16_POSITION                0x0000000A
#define _SPI3CON1_MODE16_MASK                    0x00000400
#define _SPI3CON1_MODE16_LENGTH                  0x00000001

#define _SPI3CON1_DISSDO_POSITION                0x0000000B
#define _SPI3CON1_DISSDO_MASK                    0x00000800
#define _SPI3CON1_DISSDO_LENGTH                  0x00000001

#define _SPI3CON1_DISSCK_POSITION                0x0000000C
#define _SPI3CON1_DISSCK_MASK                    0x00001000
#define _SPI3CON1_DISSCK_LENGTH                  0x00000001

#define _SPI3CON1_PPRE0_POSITION                 0x00000000
#define _SPI3CON1_PPRE0_MASK                     0x00000001
#define _SPI3CON1_PPRE0_LENGTH                   0x00000001

#define _SPI3CON1_PPRE1_POSITION                 0x00000001
#define _SPI3CON1_PPRE1_MASK                     0x00000002
#define _SPI3CON1_PPRE1_LENGTH                   0x00000001

#define _SPI3CON1_SPRE0_POSITION                 0x00000002
#define _SPI3CON1_SPRE0_MASK                     0x00000004
#define _SPI3CON1_SPRE0_LENGTH                   0x00000001

#define _SPI3CON1_SPRE1_POSITION                 0x00000003
#define _SPI3CON1_SPRE1_MASK                     0x00000008
#define _SPI3CON1_SPRE1_LENGTH                   0x00000001

#define _SPI3CON1_SPRE2_POSITION                 0x00000004
#define _SPI3CON1_SPRE2_MASK                     0x00000010
#define _SPI3CON1_SPRE2_LENGTH                   0x00000001

#define _SPI3CON2_SPIBEN_POSITION                0x00000000
#define _SPI3CON2_SPIBEN_MASK                    0x00000001
#define _SPI3CON2_SPIBEN_LENGTH                  0x00000001

#define _SPI3CON2_SPIFE_POSITION                 0x00000001
#define _SPI3CON2_SPIFE_MASK                     0x00000002
#define _SPI3CON2_SPIFE_LENGTH                   0x00000001

#define _SPI3CON2_SPIFPOL_POSITION               0x0000000D
#define _SPI3CON2_SPIFPOL_MASK                   0x00002000
#define _SPI3CON2_SPIFPOL_LENGTH                 0x00000001

#define _SPI3CON2_SPIFSD_POSITION                0x0000000E
#define _SPI3CON2_SPIFSD_MASK                    0x00004000
#define _SPI3CON2_SPIFSD_LENGTH                  0x00000001

#define _SPI3CON2_FRMEN_POSITION                 0x0000000F
#define _SPI3CON2_FRMEN_MASK                     0x00008000
#define _SPI3CON2_FRMEN_LENGTH                   0x00000001

#define _U4MODE_STSEL_POSITION                   0x00000000
#define _U4MODE_STSEL_MASK                       0x00000001
#define _U4MODE_STSEL_LENGTH                     0x00000001

#define _U4MODE_PDSEL_POSITION                   0x00000001
#define _U4MODE_PDSEL_MASK                       0x00000006
#define _U4MODE_PDSEL_LENGTH                     0x00000002

#define _U4MODE_BRGH_POSITION                    0x00000003
#define _U4MODE_BRGH_MASK                        0x00000008
#define _U4MODE_BRGH_LENGTH                      0x00000001

#define _U4MODE_RXINV_POSITION                   0x00000004
#define _U4MODE_RXINV_MASK                       0x00000010
#define _U4MODE_RXINV_LENGTH                     0x00000001

#define _U4MODE_ABAUD_POSITION                   0x00000005
#define _U4MODE_ABAUD_MASK                       0x00000020
#define _U4MODE_ABAUD_LENGTH                     0x00000001

#define _U4MODE_LPBACK_POSITION                  0x00000006
#define _U4MODE_LPBACK_MASK                      0x00000040
#define _U4MODE_LPBACK_LENGTH                    0x00000001

#define _U4MODE_WAKE_POSITION                    0x00000007
#define _U4MODE_WAKE_MASK                        0x00000080
#define _U4MODE_WAKE_LENGTH                      0x00000001

#define _U4MODE_UEN_POSITION                     0x00000008
#define _U4MODE_UEN_MASK                         0x00000300
#define _U4MODE_UEN_LENGTH                       0x00000002

#define _U4MODE_RTSMD_POSITION                   0x0000000B
#define _U4MODE_RTSMD_MASK                       0x00000800
#define _U4MODE_RTSMD_LENGTH                     0x00000001

#define _U4MODE_IREN_POSITION                    0x0000000C
#define _U4MODE_IREN_MASK                        0x00001000
#define _U4MODE_IREN_LENGTH                      0x00000001

#define _U4MODE_USIDL_POSITION                   0x0000000D
#define _U4MODE_USIDL_MASK                       0x00002000
#define _U4MODE_USIDL_LENGTH                     0x00000001

#define _U4MODE_UARTEN_POSITION                  0x0000000F
#define _U4MODE_UARTEN_MASK                      0x00008000
#define _U4MODE_UARTEN_LENGTH                    0x00000001

#define _U4MODE_PDSEL0_POSITION                  0x00000001
#define _U4MODE_PDSEL0_MASK                      0x00000002
#define _U4MODE_PDSEL0_LENGTH                    0x00000001

#define _U4MODE_PDSEL1_POSITION                  0x00000002
#define _U4MODE_PDSEL1_MASK                      0x00000004
#define _U4MODE_PDSEL1_LENGTH                    0x00000001

#define _U4MODE_UEN0_POSITION                    0x00000008
#define _U4MODE_UEN0_MASK                        0x00000100
#define _U4MODE_UEN0_LENGTH                      0x00000001

#define _U4MODE_UEN1_POSITION                    0x00000009
#define _U4MODE_UEN1_MASK                        0x00000200
#define _U4MODE_UEN1_LENGTH                      0x00000001

#define _U4STA_URXDA_POSITION                    0x00000000
#define _U4STA_URXDA_MASK                        0x00000001
#define _U4STA_URXDA_LENGTH                      0x00000001

#define _U4STA_OERR_POSITION                     0x00000001
#define _U4STA_OERR_MASK                         0x00000002
#define _U4STA_OERR_LENGTH                       0x00000001

#define _U4STA_FERR_POSITION                     0x00000002
#define _U4STA_FERR_MASK                         0x00000004
#define _U4STA_FERR_LENGTH                       0x00000001

#define _U4STA_PERR_POSITION                     0x00000003
#define _U4STA_PERR_MASK                         0x00000008
#define _U4STA_PERR_LENGTH                       0x00000001

#define _U4STA_RIDLE_POSITION                    0x00000004
#define _U4STA_RIDLE_MASK                        0x00000010
#define _U4STA_RIDLE_LENGTH                      0x00000001

#define _U4STA_ADDEN_POSITION                    0x00000005
#define _U4STA_ADDEN_MASK                        0x00000020
#define _U4STA_ADDEN_LENGTH                      0x00000001

